"""Задача 8. Требуется определить, можно ли от шоколадки размером n × m долек 
отломить k долек, если разрешается сделать один разлом по прямой между дольками 
(то есть разломить шоколадку на два прямоугольника).
3 2 4 -> yes
3 2 1 -> no
"""

n = int(input('Введите количество долек шоколодки в длину: '))
m = int(input('Введите количество долек шоколадки в ширину: '))
k = int(input('Введите количество долек в отломленном кусочке: '))
if k < m*n and (k % m == 0 or k % n == 0):
    print('Шоколадку можно разделить на два прямоугольника')
else:
    print('Ноколадку разделить на два прямоугольника - нельзя')


