""" Задача № 34. Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку разобраться
в его кричалках не настолько просто, насколько легко он их придумывает, Вам стоит написать программу. 
Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе 
стихотворения одинаковое. Фраза может состоять из одного слова, если во фразе несколько слов, то они 
разделяются дефисами. Фразы отделяются друг от друга пробелами. Стихотворение Винни-Пух вбивает 
в программу с клавиатуры. В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, 
если с ритмом все не в порядке.

Пример:
    Ввод: пара-ра-рам рам-пам-папам па-ра-па-дам 
    Вывод: парам пам-пам
"""

def fun(song):
    return sum(1 for i in song if i in 'а')
    
text = input('Винни Пух напиши стих: ').lower().split()    

t = fun(text[0])
                                             
if all([fun(i) == t for i in text]):
    print('Парам пам-пам')
else:
    print('Пам парам')
